problem_sets/cfd_suite/Exeter_CFD_Problems/data/KaplanDuct/case_fine/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS; //RAS; //RAS;

RAS
{
    RASModel kEpsilon;

    turbulence      on;
    printCoeffs     on;

    buoyantKEpsilonCoeffs
    {
        Cg      0.85;
    }
}

// ************************************************************************* //
