problem_sets/cfd_suite/Exeter_CFD_Problems/data/KaplanDuct/case_fine/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | OpenFOAM GUI Project: creativeFields           |
|  \\    /   O peration     | Version:  0.8.9.0                                  |
|   \\  /    A nd           | Web: www.c-fields.com                                       |
|    \\/     M anipulation  |                                                |
\*---------------------------------------------------------------------------*/

FoamFile
{
version	2;
format	ascii;
class	dictionary;
location	"system";
object	meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxCellSize	0.03;

surfaceFile	"mergedVolume2.stl";

localRefinement
{
    "INLET"
    {
        cellSize 0.0125;
    }
   /* "VOLUME"
    {
        cellSize 0.0125;
    }
    "ribbon.stl"
    {
       cellSize 0.0125;
    }*/
}

renameBoundary
{
    defaultName		fixedWalls;
    defaultType		wall;

    newPatchNames
    {
        "INLET"
        {
            newName     inlet;
            type     patch;
        }

        "OUTFLOW"
        {
            newName     outlet;
            type     patch;
        }

        "RCONE"
        {
            newName     rcone;
            type     wall;
        }
        "VOLUME"
        {
            newName     volume;
            type     wall;
        }
        "ribbon.stl"
        {
            newName     volume;
            type     wall;
        }
        "EXTENSION"
        {
            newName   volume;
            type wall;
        }
    }
}

boundaryLayers
{
   nLayers         5;
   firstLayerThickness 0.035;
   thicknessRatio  1.2;

    patchBoundaryLayers
    {
       "VOLUME"
        {
            nLayers           5;

            thicknessRatio    1.2;

            maxFirstLayerThickness 0.035;
        }
       "EXTENSION"
        {
            nLayers           5;

            thicknessRatio    1.2;

            maxFirstLayerThickness 0.035;
        }
    }

    optimiseLayer 10;

    optimisationParameters
    {

	nSmoothNormals 10; //5 by default
	
	maxNumIterations 10; //5 by default

	featureSizeFactor 0.3; 

	reCalculateNormals 1; //1 activates and is activated by default

	// relThicknessTol 0.1 //lower values reduce layer thickness thin and enforce uniform thickness distribution

}




// ************************************************************************* //
